Infineon/ArduinoCore-zephyr/boards.txt
frdm_mcxn947.menu.link_mode.dynamic=Dynamic
frdm_mcxn947.menu.link_mode.static=Static
frdm_mcxn947.menu.link_mode.static.build.link_mode=static
frdm_mcxn947.menu.link_mode.static.upload.extension=bin-zsk.bin

frdm_mcxn947.build.zephyr_target=frdm_mcxn947//cpu0
frdm_mcxn947.build.zephyr_args=
frdm_mcxn947.build.zephyr_hals=hal_nxp
frdm_mcxn947.build.zephyr_toolchain=arm-zephyr-eabi
frdm_mcxn947.build.variant=frdm_mcxn947_mcxn947_cpu0

frdm_mcxn947.build.extra_flags=
frdm_mcxn947.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_mcxn947.build.board=FRDM_MCXN947
frdm_mcxn947.upload_port.0.vid=0x1fc9
frdm_mcxn947.upload_port.0.pid=0x0143
frdm_mcxn947.upload.target=mcxn947vdf

frdm_mcxn947.upload.tool=pyocd
frdm_mcxn947.upload.tool.default=pyocd
frdm_mcxn947.upload.protocol=
frdm_mcxn947.upload.transport=
frdm_mcxn947.upload.use_1200bps_touch=false
frdm_mcxn947.upload.wait_for_upload_port=false
frdm_mcxn947.upload.native_usb=true

frdm_mcxn947.bootloader.tool=pyocd
frdm_mcxn947.bootloader.tool.default=pyocd
frdm_mcxn947.bootloader.file=zephyr-{build.variant}.elf
frdm_mcxn947.bootloader.target=mcxn947vdf


##########################################################################################

portentah7.name=Arduino Portenta H7
portentah7.build.core=arduino
portentah7.build.crossprefix=arm-zephyr-eabi-
portentah7.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

portentah7.menu.debug.false=Standard
portentah7.menu.debug.true=Debug
portentah7.menu.debug.true.build.zsk_args.debug=-debug

portentah7.menu.link_mode.dynamic=Dynamic
portentah7.menu.link_mode.static=Static
portentah7.menu.link_mode.static.build.link_mode=static
portentah7.menu.link_mode.static.upload.extension=bin-zsk.bin

portentah7.build.zephyr_target=arduino_portenta_h7@1.0.0//m7
portentah7.build.zephyr_args=
portentah7.build.zephyr_hals=hal_stm32 hal_infineon
portentah7.build.zephyr_toolchain=arm-zephyr-eabi
portentah7.build.artifact=zephyr_main
portentah7.build.variant=arduino_portenta_h7_stm32h747xx_m7

portentah7.build.extra_flags=
portentah7.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentah7.build.board=PORTENTA_H7_M7
portentah7.upload_port.0.vid=0x2341
portentah7.upload_port.0.pid=0x065b

portentah7.upload.tool=dfu-util
portentah7.upload.tool.default=dfu-util
portentah7.upload.protocol=
portentah7.upload.transport=
portentah7.upload.interface=0
portentah7.upload.use_1200bps_touch=true
portentah7.upload.wait_for_upload_port=true
portentah7.upload.native_usb=true

portentah7.bootloader.tool=dfu-util
portentah7.bootloader.tool.default=dfu-util
portentah7.bootloader.pid=0x035b
portentah7.bootloader.interface=0
portentah7.bootloader.file=zephyr-{build.variant}.bin
portentah7.bootloader.address=0x08040000

portentah7.debug.tool=gdb
portentah7.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
portentah7.debug.server.openocd.scripts.1={programmer.transport_script}
portentah7.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
portentah7.debug.cortex-debug.custom.request=attach
portentah7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

nicla_vision.name=Arduino Nicla Vision
nicla_vision.build.core=arduino
nicla_vision.build.crossprefix=arm-zephyr-eabi-
nicla_vision.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nicla_vision.menu.debug.false=Standard
nicla_vision.menu.debug.true=Debug
nicla_vision.menu.debug.true.build.zsk_args.debug=-debug

nicla_vision.menu.link_mode.dynamic=Dynamic
nicla_vision.menu.link_mode.static=Static
nicla_vision.menu.link_mode.static.build.link_mode=static
nicla_vision.menu.link_mode.static.upload.extension=bin-zsk.bin

nicla_vision.build.zephyr_target=arduino_nicla_vision//m7
nicla_vision.build.zephyr_args=
nicla_vision.build.zephyr_hals=hal_stm32 hal_infineon
nicla_vision.build.zephyr_toolchain=arm-zephyr-eabi
nicla_vision.build.artifact=zephyr_main
nicla_vision.build.variant=arduino_nicla_vision_stm32h747xx_m7

nicla_vision.build.extra_flags=
nicla_vision.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_vision.build.board=NICLA_VISION
nicla_vision.upload_port.0.vid=0x2341
nicla_vision.upload_port.0.pid=0x065f

nicla_vision.upload.tool=dfu-util
nicla_vision.upload.tool.default=dfu-util
nicla_vision.upload.protocol=
nicla_vision.upload.transport=
nicla_vision.upload.interface=0
nicla_vision.upload.use_1200bps_touch=true
nicla_vision.upload.wait_for_upload_port=true
nicla_vision.upload.native_usb=true

nicla_vision.bootloader.tool=dfu-util
nicla_vision.bootloader.tool.default=dfu-util
nicla_vision.bootloader.pid=0x035f
nicla_vision.bootloader.interface=0
nicla_vision.bootloader.file=zephyr-{build.variant}.bin
nicla_vision.bootloader.address=0x08040000

nicla_vision.debug.tool=gdb
nicla_vision.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_vision.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_vision.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
nicla_vision.debug.cortex-debug.custom.request=attach
nicla_vision.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##############################################################################################################

frdm_rw612.name=NXP FRDM RW612
frdm_rw612.build.core=arduino
frdm_rw612.build.crossprefix=arm-zephyr-eabi-
frdm_rw612.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

frdm_rw612.menu.debug.false=Standard
frdm_rw612.menu.debug.true=Debug
frdm_rw612.menu.debug.true.build.zsk_args.debug=-debug

frdm_rw612.menu.link_mode.dynamic=Dynamic
frdm_rw612.menu.link_mode.static=Static
frdm_rw612.menu.link_mode.static.build.link_mode=static
frdm_rw612.menu.link_mode.static.upload.extension=bin-zsk.bin

frdm_rw612.build.zephyr_target=frdm_rw612
frdm_rw612.build.zephyr_args=
frdm_rw612.build.zephyr_hals=hal_stm32
frdm_rw612.build.zephyr_toolchain=arm-zephyr-eabi
frdm_rw612.build.variant=frdm_rw612_rw612

frdm_rw612.build.extra_flags=
frdm_rw612.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
frdm_rw612.build.board=FRDM_RW612
frdm_rw612.upload_port.0.vid=0x1fc9
frdm_rw612.upload_port.0.pid=0x0143
frdm_rw612.upload.target=rw612

frdm_rw612.upload.tool=pyocd
frdm_rw612.upload.tool.default=pyocd
frdm_rw612.upload.protocol=
frdm_rw612.upload.transport=
frdm_rw612.upload.use_1200bps_touch=false
frdm_rw612.upload.wait_for_upload_port=false
frdm_rw612.upload.native_usb=true

frdm_rw612.bootloader.tool=pyocd
frdm_rw612.bootloader.tool.default=pyocd
frdm_rw612.bootloader.file=zephyr-{build.variant}.elf
frdm_rw612.bootloader.target=rw612

##########################################################################################

nicla_sense.name=Arduino Nicla Sense ME
nicla_sense.build.core=arduino
nicla_sense.build.crossprefix=arm-zephyr-eabi-
nicla_sense.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nicla_sense.menu.link_mode.dynamic=Dynamic
nicla_sense.menu.link_mode.static=Static
nicla_sense.menu.link_mode.static.build.link_mode=static
nicla_sense.menu.link_mode.static.upload.extension=bin-zsk.bin

nicla_sense.build.zephyr_target=arduino_nicla_sense_me
nicla_sense.build.zephyr_args=
nicla_sense.build.zephyr_hals=hal_nordic
nicla_sense.build.zephyr_toolchain=arm-zephyr-eabi
nicla_sense.build.artifact=zephyr_main
nicla_sense.build.variant=arduino_nicla_sense_me_nrf52832

nicla_sense.openocd_cfg=flash_sketch.cfg
nicla_sense.build.extra_flags=
nicla_sense.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_sense.build.board=NICLA_SENSE_ME
nicla_sense.upload_port.0.vid=0x2341
nicla_sense.upload_port.0.pid=0x0060

nicla_sense.upload.tool=openocd
nicla_sense.upload.tool.default=openocd
nicla_sense.upload.protocol=
nicla_sense.upload.config=-f target/nrf52.cfg
nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
nicla_sense.upload.use_1200bps_touch=false
nicla_sense.upload.wait_for_upload_port=false
nicla_sense.upload.native_usb=false
nicla_sense.upload.target=nrf52

nicla_sense.bootloader.tool=openocd
nicla_sense.bootloader.tool.default=openocd
nicla_sense.bootloader.file=zephyr-{build.variant}.hex
nicla_sense.bootloader.target=nrf52

nicla_sense.debug.tool=gdb
nicla_sense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_sense.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_sense.debug.server.openocd.scripts.2=target/nrf52.cfg
nicla_sense.debug.cortex-debug.custom.request=attach


##########################################################################################

portentac33.name=Arduino Portenta C33
portentac33.build.core=arduino
portentac33.build.crossprefix=arm-zephyr-eabi-
portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

portentac33.menu.debug.false=Standard
portentac33.menu.debug.true=Debug
portentac33.menu.debug.true.build.zsk_args.debug=-debug

