Infineon/ArduinoCore-zephyr/boards.txt
unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
unoq.menu.wait_linux_boot.app=Wait for App
unoq.menu.wait_linux_boot.app.build.boot_mode=app

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.zephyr_hals=hal_stm32
unoq.build.zephyr_toolchain=arm-zephyr-eabi
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr

unoq.openocd_cfg=flash_sketch.cfg
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##############################################################################################################

nano_connect.name=Arduino Nano RP2040 Connect
nano_connect.build.core=arduino
nano_connect.build.crossprefix=arm-zephyr-eabi-
nano_connect.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano_connect.menu.debug.false=Standard
nano_connect.menu.debug.true=Debug
nano_connect.menu.debug.true.build.zsk_args.debug=-debug

nano_connect.menu.link_mode.dynamic=Dynamic
nano_connect.menu.link_mode.static=Static
nano_connect.menu.link_mode.static.build.link_mode=static
nano_connect.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_connect.build.zephyr_target=arduino_nano_connect
nano_connect.build.zephyr_args=
nano_connect.build.zephyr_hals=hal_rpi_pico
nano_connect.build.zephyr_toolchain=arm-zephyr-eabi
nano_connect.build.artifact=zephyr_main
nano_connect.build.variant=arduino_nano_connect_rp2040

nano_connect.build.extra_flags=
nano_connect.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_connect.recipe.hooks.objcopy.postobjcopy.3.pattern="{runtime.tools.bin2uf2.path}/bin2uf2" {upload.address} {upload.familyid} "{build.path}/{build.project_name}.{upload.extension}" "{build.path}/{build.project_name}.{upload.extension}.uf2"
nano_connect.upload.artifacts.sketch={build.path}/{build.project_name}.{upload.extension}.uf2
nano_connect.build.board=NANO_RP2040_CONNECT
nano_connect.upload_port.0.vid=0x2341
nano_connect.upload_port.0.pid=0x065E

nano_connect.upload.tool=picotool
nano_connect.upload.tool.default=picotool
nano_connect.upload.protocol=
nano_connect.upload.transport=
nano_connect.upload.use_1200bps_touch=true
nano_connect.upload.wait_for_upload_port=false
nano_connect.upload.native_usb=true

nano_connect.upload.familyid=0xe48bff56

nano_connect.bootloader.tool=picotool
nano_connect.bootloader.tool.default=picotool
nano_connect.bootloader.file=zephyr-{build.variant}.uf2

nano_connect.debug.tool=gdb
nano_connect.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nano_connect.debug.server.openocd.scripts.1={programmer.transport_script}
nano_connect.debug.server.openocd.scripts.2=target/rp2040-core0.cfg
nano_connect.debug.cortex-debug.custom.request=attach
nano_connect.debug.svd_file={runtime.platform.path}/svd/rp2040.svd

##############################################################################################################

kit_pse84_ai.name=Infineon KIT-PSE84-AI (PSOC Edge E84)
kit_pse84_ai.build.core=arduino
kit_pse84_ai.build.crossprefix=arm-zephyr-eabi-
kit_pse84_ai.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

kit_pse84_ai.menu.debug.false=Standard
kit_pse84_ai.menu.debug.true=Debug
kit_pse84_ai.menu.debug.true.build.zsk_args.debug=-debug

kit_pse84_ai.menu.link_mode.dynamic=Dynamic
kit_pse84_ai.menu.link_mode.static=Static
kit_pse84_ai.menu.link_mode.static.build.link_mode=static
kit_pse84_ai.menu.link_mode.static.upload.extension=bin-zsk.bin

kit_pse84_ai.build.zephyr_target=kit_pse84_ai/pse846gps2dbzc4a/m33
kit_pse84_ai.build.zephyr_args=
kit_pse84_ai.build.zephyr_hals=hal_infineon
kit_pse84_ai.build.variant=kit_pse84_ai_pse846gps2dbzc4a_m33
kit_pse84_ai.build.mcu=cortex-m33
kit_pse84_ai.build.fpu=-mfpu=fpv5-sp-d16
kit_pse84_ai.build.architecture=cortex-m33
kit_pse84_ai.build.float-abi=-mfloat-abi=hard
kit_pse84_ai.compiler.zephyr.specs=
kit_pse84_ai.build.extra_flags=
kit_pse84_ai.build.specs=
kit_pse84_ai.build.link_command="{compiler.path}{compiler.c.elf.cmd}" "-L{build.path}" "-L{build.variant.path}" {compiler.c.elf.flags} {compiler.c.elf.extra_flags} {build.extra_flags} {build.extra_ldflags} {compiler.zephyr.common_ldflags} {compiler.ldflags} {object_files} -Wl,--start-group "{build.path}/{archive_file}" {compiler.zephyr.extra_ldflags} {compiler.libraries.ldflags} -Wl,--end-group {build.link_args.{build.link_mode}}
kit_pse84_ai.build.postbuild.cmd="{tools.openocd.path}/{tools.openocd.cmd}" exit
kit_pse84_ai.build.board=KIT_PSE84_AI
kit_pse84_ai.upload.address=0x60200000
kit_pse84_ai.upload.target=pse84
kit_pse84_ai.upload.tool=openocd
kit_pse84_ai.upload.tool.default=openocd
kit_pse84_ai.tools.openocd.path={runtime.tools.openocd.path}
kit_pse84_ai.tools.openocd.cmd=bin/openocd
kit_pse84_ai.tools.openocd.cmd.windows=bin/openocd.exe
kit_pse84_ai.programmer.default=cmsis-dap
kit_pse84_ai.tools.openocd.upload.pattern="{path}/{cmd}" {upload.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase {{build.path}/{build.project_name}.{upload.extension}} {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.program.pattern="{path}/{cmd}" {program.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase {{build.path}/{build.project_name}.{upload.extension}} {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.bootloader.pattern="{path}/{cmd}" {bootloader.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; program {{runtime.platform.path}/firmwares/zephyr-{build.variant}.hex}; reset run; shutdown"
kit_pse84_ai.tools.openocd.upload.pattern.windows=cmd /C cd /D "{build.path}" && "{path}/{cmd}" {upload.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set sketch_file [list {build.project_name}.{upload.extension}]; telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase $sketch_file {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.program.pattern.windows=cmd /C cd /D "{build.path}" && "{path}/{cmd}" {program.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set sketch_file [list {build.project_name}.{upload.extension}]; telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase $sketch_file {upload.address} bin; reset run; shutdown"
kit_pse84_ai.upload.protocol=
kit_pse84_ai.upload.transport=
kit_pse84_ai.upload.interface=0
kit_pse84_ai.upload.use_1200bps_touch=false
kit_pse84_ai.upload.wait_for_upload_port=false
kit_pse84_ai.upload.native_usb=false
kit_pse84_ai.upload.maximum_size=1047552
kit_pse84_ai.upload.maximum_data_size=135168
kit_pse84_ai.bootloader.tool=openocd
kit_pse84_ai.bootloader.tool.default=openocd
kit_pse84_ai.tools.openocd.bootloader.pattern.windows=cmd /C cd /D "{runtime.platform.path}/firmwares" && "{path}/{cmd}" {bootloader.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set bootloader_file [list zephyr-{build.variant}.hex]; telnet_port disabled; init; reset init; halt; adapter speed 10000; program $bootloader_file; reset run; shutdown"
kit_pse84_ai.bootloader.target=pse84

##############################################################################################################
